#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

```terraform

Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

The remote workspace is configured to work with configuration at
terraform-scripts relative to the target repository.

Terraform will upload the contents of the following directory,
excluding files or directories as defined by a .terraformignore file
at /home/runner/work/quarkiverse-devops/quarkiverse-devops/.terraformignore (if it is present),
in order to capture the filesystem context the remote workspace expects:
    /home/runner/work/quarkiverse-devops/quarkiverse-devops

To view this run in a browser, visit:
https://app.terraform.io/app/quarkiverse/quarkiverse-devops/runs/run-JXv1g2A9TjxW7ULj

Waiting for the plan to start...

Terraform v1.10.4
on linux_amd64
Initializing plugins and modules...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # github_repository.quarkus_config_extensions will be updated in-place
  ~ resource "github_repository" "quarkus_config_extensions" {
      ~ description                 = "Quarkus extensions to support additional configuration sources" -> "Quarkus extensions to support Microprofile Config Sources"
        id                          = "quarkus-config-extensions"
        name                        = "quarkus-config-extensions"
      ~ topics                      = [
          - "configuration",
          - "smallrye-config",
            # (1 unchanged element hidden)
        ]
        # (35 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.quarkus_infinispan_embedded will be updated in-place
  ~ resource "github_repository" "quarkus_infinispan_embedded" {
      - has_discussions             = true -> null
        id                          = "quarkus-infinispan-embedded"
        name                        = "quarkus-infinispan-embedded"
        # (35 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.quarkus_mcp_servers will be created
  + resource "github_repository" "quarkus_mcp_servers" {
      + allow_auto_merge            = false
      + allow_merge_commit          = true
      + allow_rebase_merge          = true
      + allow_squash_merge          = true
      + allow_update_branch         = true
      + archive_on_destroy          = true
      + archived                    = false
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = true
      + description                 = "Model Context Protocol Servers in Quarkus"
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + has_issues                  = true
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "quarkus-mcp-servers"
      + node_id                     = (known after apply)
      + primary_language            = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + topics                      = [
          + "mcp",
        ]
      + visibility                  = (known after apply)
      + vulnerability_alerts        = true
      + web_commit_signoff_required = false

      + security_and_analysis (known after apply)
    }

  # github_repository.quarkus_statiq will be updated in-place
  ~ resource "github_repository" "quarkus_statiq" {
      ~ description                 = "The Roq Static Site Generator allows to easily create a static website or blog using Quarkus super-powers." -> "An extension to generate/publish static pages from your Quarkus web-app"
        id                          = "quarkus-roq"
        name                        = "quarkus-roq"
        # (35 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # github_team.quarkus_mcp_servers will be created
  + resource "github_team" "quarkus_mcp_servers" {
      + create_default_maintainer = false
      + description               = "mcp-servers team"
      + etag                      = (known after apply)
      + id                        = (known after apply)
      + members_count             = (known after apply)
      + name                      = "quarkiverse-mcp-servers"
      + node_id                   = (known after apply)
      + parent_team_id            = "5344029"
      + parent_team_read_id       = (known after apply)
      + parent_team_read_slug     = (known after apply)
      + privacy                   = "closed"
      + slug                      = (known after apply)
    }

  # github_team_membership.quarkus_azure_services["zhengchang907"] will be created
  + resource "github_team_membership" "quarkus_azure_services" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "maintainer"
      + team_id  = "6620255"
      + username = "zhengchang907"
    }

  # github_team_membership.quarkus_mcp_servers["maxandersen"] will be created
  + resource "github_team_membership" "quarkus_mcp_servers" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "maintainer"
      + team_id  = (known after apply)
      + username = "maxandersen"
    }

  # github_team_repository.quarkus_mcp_servers will be created
  + resource "github_team_repository" "quarkus_mcp_servers" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "maintain"
      + repository = "quarkus-mcp-servers"
      + team_id    = (known after apply)
    }

Plan: 5 to add, 3 to change, 0 to destroy.

```

*Pusher: @gastaldi, Action: `pull_request`, Workflow: `Terraform`*